akamud.vscode-theme-onedark
charliermarsh.ruff
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-pull-request-github
gruntfuggly.todo-tree
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.powershell
mutantdino.resourcemonitor
oderwat.indent-rainbow
pkief.material-icon-theme
rangav.vscode-thunder-client
shardulm94.trailing-spaces
streetsidesoftware.code-spell-checker
usernamehw.errorlens
yzhang.markdown-all-in-one
